[
    {
      "id": 1,
      "name": "Laptop Pro 15\"",
      "description": "Experience top-tier performance and a stunning 15-inch Retina display. Ideal for creative professionals and demanding tasks, featuring ample storage and long battery life.",
      "price": 1499.90,
      "categoryId": 6,
      "stockQuantity": 15,
      "brandId": 1,
      "isActive": true
    },
    {
      "id": 2,
      "name": "Smartphone X",
      "description": "Capture life's moments with an advanced triple-camera system and enjoy vibrant visuals on the edge-to-edge OLED screen. Power through your day with optimized battery performance.",
      "price": 989.00,
      "categoryId": 9,
      "stockQuantity": 15,
      "brandId": 1,
      "isActive": true
    },
    {
      "id": 3,
      "name": "Wireless Noise-Cancelling Headphones",
      "description": "Immerse yourself in pure sound with industry-leading active noise cancellation. Enjoy superior audio clarity and all-day comfort with this ergonomic over-ear design, perfect for travel or focus.",
      "price": 349.50,
      "categoryId": 14,
      "stockQuantity": 15,
      "brandId": 1,
      "isActive": true
    },
    {
      "id": 4,
      "name": "4K Ultra HD Smart TV 55\"",
      "description": "Bring entertainment to life with breathtaking 4K Ultra HD resolution and vibrant HDR colors on this 55-inch Smart TV. Access your favorite streaming services instantly via the intuitive interface.",
      "price": 749.00,
      "categoryId": 4,
      "stockQuantity": 15,
      "brandId": 1,
      "isActive": true
    },
    {
      "id": 5,
      "name": "Digital Camera Alpha",
      "description": "Unleash your creativity with this versatile mirrorless camera. Capture sharp, detailed photos and smooth 4K video, perfect for enthusiasts and aspiring photographers exploring different styles.",
      "price": 1150.00,
      "categoryId": 3,
      "stockQuantity": 15,
      "brandId": 1,
      "isActive": true
    },
    {
      "id": 6,
      "name": "Gaming Laptop Beast",
      "description": "Dominate the competition with extreme gaming power packed into a portable chassis. Features a top-tier graphics card, ultra-fast refresh rate display, and advanced cooling for peak performance.",
      "price": 2199.00,
      "categoryId": 15,
      "stockQuantity": 15,
      "brandId": 1,
      "isActive": true
    },
    {
      "id": 7,
      "name": "Business Laptop Slim",
      "description": "Stay productive on the go with this ultra-slim and lightweight business laptop. Offers exceptional battery life, robust security features, and a comfortable typing experience for professionals.",
      "price": 1350.00,
      "categoryId": 16,
      "stockQuantity": 15,
      "brandId": 1,
      "isActive": true
    },
    {
      "id": 8,
      "name": "Mechanical Keyboard RGB",
      "description": "Elevate your typing and gaming experience with satisfying tactile feedback from premium mechanical switches. Customize your setup with vibrant per-key RGB backlighting and durable construction.",
      "price": 89.00,
      "categoryId": 12,
      "stockQuantity": 15,
      "brandId": 1,
      "isActive": true
    },
    {
      "id": 9,
      "name": "Tablet Tab S9",
      "description": "Discover the ultimate versatile tablet for productivity and entertainment. Features a large, vibrant display perfect for multitasking, note-taking with stylus support, and immersive media consumption.",
      "price": 699.00,
      "categoryId": 8,
      "stockQuantity": 0,
      "brandId": 1,
      "isActive": true
    }
  ]
  